Ran Plan for dir: `live/newsletter-server` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt plan -input=false $(printf '%s' $COMMENT_ARGS | sed 's/,/ /g' | tr -d '\\\\') -no-color -out $PLANFILE" in "/atlantis-data/repos/meysam81/infra/41/default/live/newsletter-server": exit status 1: running "terragrunt plan -input=false $(printf '%s' $COMMENT_ARGS | sed 's/,/ /g' | tr -d '\\\\') -no-color -out $PLANFILE" in "/atlantis-data/repos/meysam81/infra/41/default/live/newsletter-server": 
15:01:00.296 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: Initializing the backend...
15:01:00.309 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: Initializing the backend...
15:01:01.487 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: 
15:01:01.487 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: Successfully configured the backend "remote"! OpenTofu will automatically
15:01:01.487 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: use this backend unless the backend configuration changes.
15:01:01.496 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: 
15:01:01.496 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: Successfully configured the backend "remote"! OpenTofu will automatically
15:01:01.496 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: use this backend unless the backend configuration changes.
15:01:02.479 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: Initializing provider plugins...
15:01:02.480 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: - Reusing previous version of integrations/github from the dependency lock file
15:01:02.501 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: Initializing provider plugins...
15:01:02.501 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Reusing previous version of integrations/github from the dependency lock file
15:01:02.687 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Reusing previous version of hashicorp/random from the dependency lock file
15:01:02.696 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: - Reusing previous version of olivr/gpg from the dependency lock file
15:01:02.744 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Reusing previous version of hashicorp/tls from the dependency lock file
15:01:04.092 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: - Installing integrations/github v6.3.0...
15:01:04.120 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Installing integrations/github v6.3.0...
15:01:05.038 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Installed integrations/github v6.3.0 (signed, key ID 38027F80D7FD5FB2)
15:01:05.051 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: - Installed integrations/github v6.3.0 (signed, key ID 38027F80D7FD5FB2)
15:01:06.275 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Installing hashicorp/random v3.6.3...
15:01:06.348 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: - Installing olivr/gpg v0.2.1...
15:01:07.130 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Installed hashicorp/random v3.6.3 (signed, key ID 0C0AF313E5FD9F80)
15:01:07.218 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: - Installed olivr/gpg v0.2.1. Signature validation was skipped due to the registry not containing GPG keys for this provider
15:01:07.218 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: Providers are signed by their developers.
15:01:07.218 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: If you'd like to know more about provider signing, you can read about it here:
15:01:07.218 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: https://opentofu.org/docs/cli/plugins/signing/
15:01:07.218 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: OpenTofu has made some changes to the provider dependency selections recorded
15:01:07.218 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: in the .terraform.lock.hcl file. Review those changes and commit them to your
15:01:07.218 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: version control system if they represent changes you intended to make.
15:01:07.218 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: OpenTofu has been successfully initialized!
15:01:08.363 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Installing hashicorp/tls v4.0.6...
15:01:09.226 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Installed hashicorp/tls v4.0.6 (signed, key ID 0C0AF313E5FD9F80)
15:01:09.227 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: Providers are signed by their developers.
15:01:09.227 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: If you'd like to know more about provider signing, you can read about it here:
15:01:09.227 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: https://opentofu.org/docs/cli/plugins/signing/
15:01:09.227 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: OpenTofu has made some changes to the provider dependency selections recorded
15:01:09.227 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: in the .terraform.lock.hcl file. Review those changes and commit them to your
15:01:09.227 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: version control system if they represent changes you intended to make.
15:01:09.228 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: OpenTofu has been successfully initialized!
15:01:11.579 STDOUT tofu1.8.3: Initializing the backend...
15:01:12.723 STDOUT tofu1.8.3: Successfully configured the backend "remote"! OpenTofu will automatically
15:01:12.723 STDOUT tofu1.8.3: use this backend unless the backend configuration changes.
15:01:13.667 STDOUT tofu1.8.3: Initializing provider plugins...
15:01:13.667 STDOUT tofu1.8.3: - Reusing previous version of hetznercloud/hcloud from the dependency lock file
15:01:13.779 STDOUT tofu1.8.3: - Reusing previous version of hashicorp/tls from the dependency lock file
15:01:13.825 STDOUT tofu1.8.3: - Reusing previous version of hashicorp/random from the dependency lock file
15:01:13.901 STDOUT tofu1.8.3: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
15:01:14.058 STDOUT tofu1.8.3: - Reusing previous version of hashicorp/aws from the dependency lock file
15:01:14.126 STDOUT tofu1.8.3: - Finding latest version of hashicorp/null...
15:01:15.464 STDOUT tofu1.8.3: - Installing hashicorp/null v3.2.3...
15:01:16.220 STDOUT tofu1.8.3: - Installed hashicorp/null v3.2.3 (signed, key ID 0C0AF313E5FD9F80)
15:01:17.512 STDOUT tofu1.8.3: - Installing hetznercloud/hcloud v1.48.1...
15:01:18.447 STDOUT tofu1.8.3: - Installed hetznercloud/hcloud v1.48.1 (signed, key ID 5219EACB3A77198B)
15:01:19.294 STDOUT tofu1.8.3: - Installing hashicorp/tls v4.0.6...
15:01:20.010 STDOUT tofu1.8.3: - Installed hashicorp/tls v4.0.6 (signed, key ID 0C0AF313E5FD9F80)
15:01:20.890 STDOUT tofu1.8.3: - Installing hashicorp/random v3.6.3...
15:01:21.583 STDOUT tofu1.8.3: - Installed hashicorp/random v3.6.3 (signed, key ID 0C0AF313E5FD9F80)
15:01:22.796 STDOUT tofu1.8.3: - Installing cloudflare/cloudflare v4.42.0...
15:01:24.021 STDOUT tofu1.8.3: - Installed cloudflare/cloudflare v4.42.0 (signed, key ID C76001609EE3B136)
15:01:25.250 STDOUT tofu1.8.3: - Installing hashicorp/aws v5.68.0...
15:01:33.103 STDOUT tofu1.8.3: - Installed hashicorp/aws v5.68.0 (signed, key ID 0C0AF313E5FD9F80)
15:01:33.103 STDOUT tofu1.8.3: Providers are signed by their developers.
15:01:33.104 STDOUT tofu1.8.3: If you'd like to know more about provider signing, you can read about it here:
15:01:33.104 STDOUT tofu1.8.3: https://opentofu.org/docs/cli/plugins/signing/
15:01:33.104 STDOUT tofu1.8.3: OpenTofu has made some changes to the provider dependency selections recorded
15:01:33.104 STDOUT tofu1.8.3: in the .terraform.lock.hcl file. Review those changes and commit them to your
15:01:33.104 STDOUT tofu1.8.3: version control system if they represent changes you intended to make.
15:01:33.104 STDOUT tofu1.8.3: OpenTofu has been successfully initialized!
15:01:39.669 STDOUT tofu1.8.3: tls_private_key.this: Refreshing state... [id=66dfe3eccaa9b069015a22812e79e4c13ae8033a]
15:01:39.670 STDOUT tofu1.8.3: random_password.k3s_token: Refreshing state... [id=none]
15:01:39.677 STDOUT tofu1.8.3: data.cloudflare_zone.this: Reading...
15:01:39.677 STDOUT tofu1.8.3: hcloud_primary_ip.this["ipv6"]: Refreshing state... [id=68641522]
15:01:39.677 STDOUT tofu1.8.3: hcloud_network.this: Refreshing state... [id=10090102]
15:01:39.678 STDOUT tofu1.8.3: hcloud_primary_ip.this["ipv4"]: Refreshing state... [id=68641521]
15:01:39.678 STDOUT tofu1.8.3: hcloud_volume.varlib: Refreshing state... [id=101246358]
15:01:39.689 STDOUT tofu1.8.3: hcloud_firewall.this: Refreshing state... [id=1587707]
15:01:39.726 STDOUT tofu1.8.3: hcloud_ssh_key.this: Refreshing state... [id=22765653]
15:01:39.855 STDOUT tofu1.8.3: hcloud_network_subnet.this: Refreshing state... [id=10090102-172.16.16.0/20]
15:01:40.023 STDOUT tofu1.8.3: hcloud_server.this: Refreshing state... [id=52684920]
15:01:40.268 STDOUT tofu1.8.3: hcloud_server_network.this: Refreshing state... [id=52684920-10090102]
15:01:40.268 STDOUT tofu1.8.3: hcloud_volume_attachment.varlib: Refreshing state... [id=101246358]
15:01:40.268 STDOUT tofu1.8.3: hcloud_firewall_attachment.this: Refreshing state... [id=1587707]
15:01:40.634 STDOUT tofu1.8.3: data.cloudflare_zone.this: Read complete after 1s [id=e0cc9a85b6f39e176952e80f9b744248]
15:01:40.646 STDOUT tofu1.8.3: cloudflare_record.newsletter["A"]: Refreshing state... [id=d95b423dfa835ab2119e2632418b3042]
15:01:40.649 STDOUT tofu1.8.3: cloudflare_record.vmagent["AAAA"]: Refreshing state... [id=68f9441c3cec3f737ef002bde5ffca29]
15:01:40.650 STDOUT tofu1.8.3: cloudflare_record.vmsingle["A"]: Refreshing state... [id=d1a7ec5d2b154f3e0c54b031dd2dc683]
15:01:40.653 STDOUT tofu1.8.3: cloudflare_record.vmagent["A"]: Refreshing state... [id=0352915c8f7b31f76a83bdeaab37356e]
15:01:40.654 STDOUT tofu1.8.3: cloudflare_record.vmsingle["AAAA"]: Refreshing state... [id=e550a66b7b467537ab35e4aa8bfc45fa]
15:01:40.654 STDOUT tofu1.8.3: cloudflare_record.newsletter["AAAA"]: Refreshing state... [id=faa03b14676e9bed2bca92864c4ec66b]
15:01:40.654 STDOUT tofu1.8.3: cloudflare_record.auth["A"]: Refreshing state... [id=eeb2a3fd0f6b0e42abc21a1c3785fb21]
15:01:40.654 STDOUT tofu1.8.3: cloudflare_record.auth_server["AAAA"]: Refreshing state... [id=fb1167036309a495d9ae9e5b11a61c33]
15:01:40.656 STDOUT tofu1.8.3: cloudflare_record.auth["AAAA"]: Refreshing state... [id=709856879eca01fc17ca016cacd1389b]
15:01:40.727 STDOUT tofu1.8.3: cloudflare_record.auth_server["A"]: Refreshing state... [id=b18e490903f09fef85d3f8a201135cfd]
15:01:41.357 STDOUT tofu1.8.3: cloudflare_record.alertmanager["A"]: Refreshing state... [id=02c0c652542029a4374b2512407d10cf]
15:01:41.486 STDOUT tofu1.8.3: cloudflare_record.atlantis["A"]: Refreshing state... [id=af003e07497ecfb0be30129aa18ccdee]
15:01:41.925 STDOUT tofu1.8.3: cloudflare_record.atlantis["AAAA"]: Refreshing state... [id=19a129e63172a0e0bcda002360d67f15]
15:01:41.926 STDOUT tofu1.8.3: cloudflare_record.alertmanager["AAAA"]: Refreshing state... [id=70ea2da720f31529b05ed98ffb835db8]
15:01:44.707 STDOUT tofu1.8.3: OpenTofu used the selected providers to generate the following execution
15:01:44.707 STDOUT tofu1.8.3: plan. Resource actions are indicated with the following symbols:
15:01:44.707 STDOUT tofu1.8.3:   + create
15:01:44.707 STDOUT tofu1.8.3:   ~ update in-place
15:01:44.707 STDOUT tofu1.8.3: -/+ destroy and then create replacement
15:01:44.707 STDOUT tofu1.8.3: OpenTofu planned the following actions, but then encountered a problem:
15:01:44.707 STDOUT tofu1.8.3:   # hcloud_firewall_attachment.this will be updated in-place
15:01:44.707 STDOUT tofu1.8.3:   ~ resource "hcloud_firewall_attachment" "this" {
15:01:44.707 STDOUT tofu1.8.3:         id              = "1587707"
15:01:44.707 STDOUT tofu1.8.3:       ~ server_ids      = [
15:01:44.707 STDOUT tofu1.8.3:           - 52684920,
15:01:44.707 STDOUT tofu1.8.3:         ] -> (known after apply)
15:01:44.707 STDOUT tofu1.8.3:         # (2 unchanged attributes hidden)
15:01:44.708 STDOUT tofu1.8.3:     }
15:01:44.708 STDOUT tofu1.8.3:   # hcloud_server.this must be replaced
15:01:44.708 STDOUT tofu1.8.3: -/+ resource "hcloud_server" "this" {
15:01:44.708 STDOUT tofu1.8.3:       + backup_window              = (known after apply)
15:01:44.708 STDOUT tofu1.8.3:       ~ datacenter                 = "nbg1-dc3" -> (known after apply)
15:01:44.708 STDOUT tofu1.8.3:       ~ firewall_ids               = [
15:01:44.708 STDOUT tofu1.8.3:           - 1587707,
15:01:44.708 STDOUT tofu1.8.3:         ] -> (known after apply)
15:01:44.708 STDOUT tofu1.8.3:       ~ id                         = "52684920" -> (known after apply)
15:01:44.708 STDOUT tofu1.8.3:       ~ ipv4_address               = "128.140.71.149" -> (known after apply)
15:01:44.708 STDOUT tofu1.8.3:       ~ ipv6_address               = "2a01:4f8:1c1b:68c6::1" -> (known after apply)
15:01:44.708 STDOUT tofu1.8.3:       ~ ipv6_network               = "2a01:4f8:1c1b:68c6::/64" -> (known after apply)
15:01:44.709 STDOUT tofu1.8.3:       - labels                     = {} -> null
15:01:44.709 STDOUT tofu1.8.3:         name                       = "personal"
15:01:44.709 STDOUT tofu1.8.3:       - placement_group_id         = 0 -> null
15:01:44.709 STDOUT tofu1.8.3:       ~ primary_disk_size          = 40 -> (known after apply)
15:01:44.709 STDOUT tofu1.8.3:       ~ status                     = "running" -> (known after apply)
15:01:44.709 STDOUT tofu1.8.3:       ~ user_data                  = (sensitive value) # forces replacement
15:01:44.709 STDOUT tofu1.8.3:         # (10 unchanged attributes hidden)
15:01:44.709 STDOUT tofu1.8.3:         # (1 unchanged block hidden)
15:01:44.709 STDOUT tofu1.8.3:     }
15:01:44.709 STDOUT tofu1.8.3:   # hcloud_server_network.this must be replaced
15:01:44.709 STDOUT tofu1.8.3: -/+ resource "hcloud_server_network" "this" {
15:01:44.709 STDOUT tofu1.8.3:       - alias_ips   = [] -> null
15:01:44.709 STDOUT tofu1.8.3:       ~ id          = "52684920-10090102" -> (known after apply)
15:01:44.710 STDOUT tofu1.8.3:       ~ ip          = "172.16.16.1" -> (known after apply)
15:01:44.710 STDOUT tofu1.8.3:       ~ mac_address = "86:00:00:fa:b1:cf" -> (known after apply)
15:01:44.710 STDOUT tofu1.8.3:       ~ server_id   = 52684920 # forces replacement -> (known after apply) # forces replacement
15:01:44.710 STDOUT tofu1.8.3:         # (1 unchanged attribute hidden)
15:01:44.710 STDOUT tofu1.8.3:     }
15:01:44.710 STDOUT tofu1.8.3:   # hcloud_volume_attachment.varlib must be replaced
15:01:44.710 STDOUT tofu1.8.3: -/+ resource "hcloud_volume_attachment" "varlib" {
15:01:44.710 STDOUT tofu1.8.3:       ~ id        = "101246358" -> (known after apply)
15:01:44.710 STDOUT tofu1.8.3:       ~ server_id = 52684920 # forces replacement -> (known after apply) # forces replacement
15:01:44.710 STDOUT tofu1.8.3:         # (2 unchanged attributes hidden)
15:01:44.710 STDOUT tofu1.8.3:     }
15:01:44.710 STDOUT tofu1.8.3:   # null_resource.example will be created
15:01:44.710 STDOUT tofu1.8.3:   + resource "null_resource" "example" {
15:01:44.710 STDOUT tofu1.8.3:       + id = (known after apply)
15:01:44.710 STDOUT tofu1.8.3:     }
15:01:44.711 STDOUT tofu1.8.3: Plan: 4 to add, 1 to change, 3 to destroy.
15:01:44.711 STDOUT tofu1.8.3: Changes to Outputs:
15:01:44.711 STDOUT tofu1.8.3:   ~ cloudinit_config = (sensitive value)
15:01:44.711 STDERR tofu1.8.3: Error: Invalid provider configuration
15:01:44.711 STDERR tofu1.8.3: Provider "registry.opentofu.org/hashicorp/aws" requires explicit
15:01:44.711 STDERR tofu1.8.3: configuration. Add a provider block to the root module and configure the
15:01:44.711 STDERR tofu1.8.3: provider's required arguments as described in the provider documentation.
15:01:44.711 STDERR tofu1.8.3: Error: No valid credential sources found
15:01:44.711 STDERR tofu1.8.3:   with provider["registry.opentofu.org/hashicorp/aws"],
15:01:44.711 STDERR tofu1.8.3:   on provider["registry.opentofu.org/hashicorp/aws"] with no configuration line 1:
15:01:44.711 STDERR tofu1.8.3:   (source code not available)
15:01:44.711 STDERR tofu1.8.3: Please see https://registry.terraform.io/providers/hashicorp/aws
15:01:44.712 STDERR tofu1.8.3: for more information about providing credentials.
15:01:44.712 STDERR tofu1.8.3: Error: failed to refresh cached credentials, failed to retrieve jwt from
15:01:44.712 STDERR tofu1.8.3: provide source, unable to read file at
15:01:44.712 STDERR tofu1.8.3: /var/run/secrets/sts.amazonaws.com/serviceaccount/token: open
15:01:44.712 STDERR tofu1.8.3: /var/run/secrets/sts.amazonaws.com/serviceaccount/token: no such file or
15:01:44.712 STDERR tofu1.8.3: directory
15:01:44.988 ERROR  tofu invocation failed in .
15:01:44.988 ERROR  error occurred:

* Failed to execute "tofu1.8.3 plan -input=false -no-color -out ./default.tfplan" in .
  
  Error: Invalid provider configuration
  
  Provider "registry.opentofu.org/hashicorp/aws" requires explicit
  configuration. Add a provider block to the root module and configure the
  provider's required arguments as described in the provider documentation.
  
  
  Error: No valid credential sources found
  
    with provider["registry.opentofu.org/hashicorp/aws"],
    on provider["registry.opentofu.org/hashicorp/aws"] with no configuration line 1:
    (source code not available)
  
  Please see https://registry.terraform.io/providers/hashicorp/aws
  for more information about providing credentials.
  
  Error: failed to refresh cached credentials, failed to retrieve jwt from
  provide source, unable to read file at
  /var/run/secrets/sts.amazonaws.com/serviceaccount/token: open
  /var/run/secrets/sts.amazonaws.com/serviceaccount/token: no such file or
  directory
  
  
  exit status 1

15:01:45.007 ERROR  Suggested fixes: 
Missing AWS credentials. Provide credentials to proceed.


```
</details>